Tekla Open API Reference for Tekla Structures 2025
ProfileItem.GetProfileItemSubTypes Method
 Selects the profile item and updates the sub types in the profile database.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<ProfileItemSubType> GetProfileItemSubTypes()
Public Function GetProfileItemSubTypes As List(Of ProfileItemSubType)
Return Value
Type: List<ProfileItemSubType>
[Missing <returns> documentation for "M:Tekla.Structures.Catalogs.ProfileItem.GetProfileItemSubTypes"]
See Also
Reference
ProfileItem Class
GetProfileItemSubTypes Overload
Tekla.Structures.Catalogs Namespace